{
  "_class_name": "FluxTransformer2DModel",
  "_diffusers_version": "0.32.0.dev0",
  "attention_head_dim": 128,
  "axes_dims_rope": [
    16,
    56,
    56
  ],
  "guidance_embeds": true,
  "in_channels": 384,
  "joint_attention_dim": 4096,
  "num_attention_heads": 24,
  "num_layers": 19,
  "num_single_layers": 38,
  "out_channels": 64,
  "patch_size": 1,
  "pooled_projection_dim": 768
}
